#!/bin/bash

echo "Запуск тестов..."

echo "Тест №1: x + ( y )"
./lab3 \x + \( y \)

echo "Тест №2: {x + ( y + z )"
./lab3 \{ x + \( y + z \)

echo "Тест №3: x - [ ( y ) + { z } ]"
./lab3 x - \[ \( y \) + \{ z \} \]

echo "Тест №4: x - [ ( + y ) - + { z } ]"
./lab3 x - \[ \( + y \) - + \{ z \} \]

echo "Тест №5: [ ( ( x ) + [ y ] ) - x ]"
./lab3 \[ \( \( x \) + \[ y \] \) - x \]

echo "Тест №6: { ( } + x )"
./lab3 \{ \( \} + x \)

echo "Тест №7: ( x + y + z + { ( [ x ] ] } ) )"
./lab3 \( x + y + z + \{ \( \[ x \] \] \} \) \)

echo "Тест №8: x + y + 1 + 54 + z"
./lab3 x + y + 1 + 54 + z

echo "Тест №9: x + y + 123"
./lab3 x + y + 123

echo "Тест №10: x + y + 5 + 66 + z"
./lab3 x + y + 5 + 66 + z

echo "Тест №11: { ( } + 34 + 43 + x ( 232 ) )"
./lab3 \{ \( \} + 34 + 43 + x \( 232 \) \)